my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200]                                                                                                                                              
print(my_list[0:10])  # ელემენტები ინდექსიდან 0 (10-ია)
[10, 20, 30, 40, 50, 60, 70, 80, 90, 100]      
# ელემენტები 5-დან 15-მდე (15 არ შედის)
print(my_list[5:15])                                               
[60, 80, 100, 120, 140] 
# აირჩიეთ 5-დან 15-მდე ელემენტები, მაგრამ მხოლოდ ყოველ მეორე ელემენტზე:
print(my_list[5:15:2])  # every second element
[60, 70, 80, 90, 100, 110, 120, 130, 140, 150]