// DOM ნიშნავს Document Object Model-ს.
// ეს არის ვებგვერდის სტრუქტურული მოდელი, რომელიც წარმოადგენს HTML დოკუმენტს, როგორც ობიექტების ნაკეთებს (ობიექტური სტრუქტურა).
// JavaScript-ს შეუძლია გამოიყენოს DOM იმისთვის, რომ წაიკითხოს, შეცვალოს ან დაამატოს ელემენტები HTML გვერდზე.
// მაგალითად, შეგვიძლია ვიპოვოთ კონკრეტული ელემენტი და შევცვალოთ მისი ტექსტი ან სტილი.

// .getElementById არის DOM მეთოდი, რომელიც საშუალებას გვაძლევს მივწვდეთ კონკრეტულ HTML ელემენტს მისი ID-ის მიხედვით.
// მაგალითად, თუ გვინდა შევცვალოთ h1 ელემენტის ტექსტი, რომელსაც აქვს ID="title", ვიყენებთ ამ მეთოდს.
// ეს მეთოდი აბრუნებს იმ ელემენტს, რომელსაც გვაქვს მითითებული ID.

// ცვლადში ვინახავთ წინადადებას
let sentence = "goa is best";

// ვიღებთ წვდომას პარაგრაფზე ID-ის მიხედვით
let paragraph = document.getElementById("myParagraph");

// ვცვლით პარაგრაფის ტექსტს sentence ცვლადით
paragraph.textContent = sentence;

document.title = "goa best"
document.body.style.backgroundcolor = "lime";
console.dir(document);
