/* async არის რომ რიგში არ დგება არ ელოდება */

/* async ოპერაცია არის აი მაგალითად რაღაცას იწერ მაგრამ არ ელოდები და ამავდროულად სხვა რაღაცას აკეთებ*/

/*  ობიექტია არის რომ რაღაცას პირდები მაგალითად (მამა:თუ გოაში გახვალ პირველზე გაჩუქებ ტელეფონს)
შენ არ იცი გახვალ პირველზე თუ არა მაგრამ თუ გახვალ მიიღებ ტელეფონს*/

/* promise ობიექტი იყოფა სამ ნაწილად pending, result და reject თითოეულს აქვს სხვადასხვა ნაირი მნიშვნელობა
pending = მოლოდინი, resolve = პასუხი(კაი) და reject = პასუხი(ცუდი) */

/* settimeout ფუნქცია ინიშნავს დროს სანამ უნდა გააკეთო რამე*/